//INPUT VARIABLES				NICK HOUSER
STRING I-REC, I-LNAME, I-FNAME,I-ADDRESS, I-CITY,I-STATE, I-TEAM
INTEGER I-ZIP, I-POP-TYPE, I-#CASES

//CALCULATED VARIABLES
STRING EOF= "FALSE" O-DATE,

DOUBLE C-DEPOSIT-AMT, C-TOTAL-SALES,  GT-TEAMA-AMT = 0, GT-TEAMB-AMT = 0, GT-TEAMC-AMT = 0,
	GT-TEAMD-AMT = 0, GT-TEAME-AMT = 0 

INTEGER GT-POP1-CASES = 0, GT-POP2-CASES = 0, GT-POP3-CASES = 0,
	GT-POP4-CASES = 0, GT-POP5-CASES = 0, GT-POP6-CASES = 0,PCTR-D = 0, PCTR-E =0
	
//VALIDATION VARIABLES
BOOLEAN VAL-STATE, VAL-5CENT, VAL-POP-TYPE, 


//OUTPUT VARIABLES
STRING O-LNAME, O-FNAME, O-CITY, O-STATE, O-ZIP, O-POP-TYPE, O-#CASES, O-DEPOSIT-AMT,
	O-TOTAL-SALES, O-GT-POP1, O-GT-POP2, O-GT-POP3, O-GT-POP1-CASES,
	O-GT-POP2-CASES, O-GT-POP3-CASES, O-ERR-CTR, O-PCTR, O-TEAM, O-GT-TEAM-AMT,
	O-ERR-REC, O-ERR-DESC, O-REPORT, O-REC

MAIN
	1000-INIT
	WHILE EOF == 'FALSE'
		CALL 2000-MAINLINE
	END-WHILE
	3000-CLOSING

1000-INIT
	OPEN INPUT FILE
	OPEN OUTPUT FILE-RECORDS
	OPEN OUTPUT FILE-ERRORS
	O-DATE = FORMAT(SYSDATE)
	CALL 9900-HEADINGS-DETAIL
	CALL 9910-HEADINGS-ERROR
	CALL 9000-READ
	
2000-MAINLINE
	PERFORM 2100-VALIDATION THRU 2100-X.
	IF ERROR-SWITCH == "PASS"
		CALL 2200-CALCS
		CALL 2300-OUTPUT
	ELSE
		CALL 2400-ERROR-ROUTINE.
	PERFORM READ.
	
2100-VALIDATION
	MOVE "FAIL" TO ERROR-SWITCH
	IF I-LNAME = " "
		MOVE "LAST NAME IS REQUIRED." TO O-ERR-DESC
		GO TO 2100-X.
	
	IF I-FNAME = " "
		MOVE "FIRST NAME IS REQUIRED." TO O-ERR-DESC
		GO TO 2100-X.
	
	IF I-ADDRESS = " "
		MOVE "ADDRESS IS REQUIRED." TO O-ERR-DESC
		GO TO 2100-X.
	
	IF I-CITY = " "
		MOVE "CITY IS REQUIRED."
		GO TO 2100-X.
	
	IF NOT VAL-STATE
		MOVE "VALID STATES ARE IA, IL, MI, MO, NE AND WI." TO O-ERR-DESC
		GO TO 2100-X.
	
	IF I-ZIP NOT NUMERIC
		MOVE "ZIP CODE CAN ONLY BE NUMERIC." TO O-ERR-DESC
		PERFORM 2100-X.
	
	IF I-POP-TYPE NOT NUMERIC
		MOVE "POP TYPE MUST BE NUMERIC" TO O-ERR-DESC
		PERFORM 2100-X.
	
	IF NOT VAL-POP-TYPE
		MOVE "POP TYPE MUST BE 1 THROUGH 6." TO O-ERR-DESC
		PERFORM 2100-X.
	
	IF I-#CASES NOT NUMERIC
		MOVE "NUMBER OF CASES MUST BE NUMERIC." TO O-ERR-DESC
		PERFORM 2100-X.
	
	IF I-#CASES = 0
		MOVE "CASES ORDERED MUST BE A MINIMUM OF 1." TO O-ERR-DESC
		PERFORM 2100-X.
	
	IF I-TEAM NOT 'A' THRU 'E'
		MOVE "TEAM NAMES MUST BE A THROUGH E." TO O-ERR-DESC
		PERFORM 2100-X.
	MOVE "PASS" TO ERROR-SWITCH.

2100-X.
	EXIT.

2200-CALCS
	C-DEPOSIT-AMT = 0.
	IF VAL-5CENT
		MULTIPLY .05 24 I-#CASES GIVING C-DEPOSIT-AMT.
	IF I-STATE = "WI"
		MULTIPLY .1 24 I-#CASES GIVING C-DEPOSIT-AMT.
	COMPUTE C-TOTAL-SALES = 18.71 * I-#CASES + C-DEPOSIT-AMT.
	SELECT I-POP-TYPE
		WHEN 01
			O-POP-TYPE = "COKE"
			ADD I-#CASES TO GT-POP1-CASES
		WHEN 02
			O-POP-TYPE = "DIET COKE"
			ADD I-#CASES TO GT-POP2-CASES
		WHEN 03
			O-POP-TYPE = "MELLO YELLO"
			ADD I-#CASES TO GT-POP3-CASES
		WHEN 04
			O-POP-TYPE = "CHERRY COKE"
			ADD I-#CASES TO GT-POP4-CASES
		WHEN 05
			O-POP-TYPE = "DIET CHERRY COKE"
			ADD I-#CASES TO GT-POP5-CASES
		WHEN 06
			O-POP-TYPE = "SPRITE"
			ADD I-#CASES TO GT-POP6-CASES.
			
	SELECT I-TEAM
		WHEN 'A'
			ADD C-TOTAL-SALES TO GT-TEAMA-AMT
		WHEN 'B'
			ADD C-TOTAL-SALES TO GT-TEAMB-AMT
		WHEN 'C'
			ADD C-TOTAL-SALES TO GT-TEAMC-AMT
		WHEN 'D'
			ADD C-TOTAL-SALES TO GT-TEAMD-AMT
		WHEN 'E'
			ADD C-TOTAL-SALES TO GT-TEAME-AMT.
	

2300-OUTPUT
	MOVE I-LNAME TO O-LNAME
	MOVE I-FNAME TO O-FNAME
	MOVE I-CITY TO O-CITY
	MOVE I-STATE TO O-STATE
	MOVE I-ZIP TO O-ZIP
	MOVE I-#CASES TO O-#CASES
	MOVE C-DEPOSIT-AMT TO O-DEPOSIT-AMT
	MOVE C-TOTAL-SALES TO O-TOTAL-SALES
		AT EOP
			PERFORM 9900-HEADINGS-DETAIL

2400-ERROR-ROUTINE
	ADD 1 TO ERR-CTR
	MOVE I-REC TO O-REC
	PRINT ERRLINE FROM ERRORLINE
		AFTER ADVANCING 2 LINES
			AT EOP 
				PERFORM 9910-HEADINGS-ERROR.

3000-CLOSING
	PERFORM 4100-GRAND-TOTALS
	CLOSE INPUT FILE
	CLOSE OUTPUT FILE-RECORDS
	CLOSE OUTPUT FILE-ERROR

3100-GRAND-TOTALS
							//ERROR GT
	MOVE ERR-CTR TO O-ERR-CTR
		PRINT GT-ERROR-LINE
		AFTER ADVANCING 3 LINES.
	
	PERFORM 9900-HEADINGS-DETAIL			//POP CASES GT
		AFTER ADVANCING 1 PAGE.
	MOVE "COKE" TO O-GT-POP1.
	MOVE GT-POP1-CASES TO O-GT-POP1-CASES
	MOVE "DIET COKE" TO O-GT-POP2.
	MOVE GT-POP2-CASES TO O-GT-POP2-CASES
	MOVE "MELLO YELLO" TO O-GT-POP3.
	MOVE GT-POP3-CASES TO O-GT-POP3-CASES
	PRINT GRAND-TOTAL-TITLE
		AFTER ADVANCING 1 LINE
	PRINT GT-CASES-LINE
		AFTER ADVANCING 2 LINES
	MOVE "CHERRY COKE" TO O-GT-POP1.
	MOVE GT-POP4-CASES TO O-GT-POP1-CASES
	MOVE "DIET CHERRY COKE" TO O-GT-POP2.
	MOVE GT-POP5-CASES TO O-GT-POP2-CASES
	MOVE "SPRITE" TO O-GT-POP3.
	MOVE GT-POP6-CASES TO O-GT-POP3-CASES
	PRINT GT-CASES-LINE
		AFTER ADVANCING 2 LINES
		
	PRINT TEAM-TOTAL-TITLE				//TEAM GT
		AFTER ADVANCING 3 LINES
	MOVE 'A' TO O-TEAM
	MOVE GT-TEAMA-AMT TO O-GT-TEAM-AMT
	PRINT TEAM GT-LINE
		AFTER ADVANCING 2 LINES
	MOVE 'B' TO O-TEAM
	MOVE GT-TEAMB-AMT TO O-GT-TEAM-AMT
	PRINT TEAM GT-LINE
		AFTER ADVANCING 2 LINES
	MOVE 'C' TO O-TEAM
	MOVE GT-TEAMC-AMT TO O-GT-TEAM-AMT
	PRINT TEAM GT-LINE
		AFTER ADVANCING 2 LINES
	MOVE 'D' TO O-TEAM
	MOVE GT-TEAMD-AMT TO O-GT-TEAM-AMT
	PRINT TEAM GT-LINE
		AFTER ADVANCING 2 LINES
	MOVE 'E' TO O-TEAM
	MOVE GT-TEAME-AMT TO O-GT-TEAM-AMT
	PRINT TEAM GT-LINE
		AFTER ADVANCING 2 LINES	

9000-READ
	READ RECORD:I-REC, I-LNAME, I-FNAME, I-ADDRESS, I-CITY, I-STATE, I-ZIP,
		I-POP-TYPE, I-#CASES, I-TEAM
	IF NO MORE RECORDS
		EOF = "TRUE"

9900-HEADINGS-DETAIL
	PCTR-D++
	MOVE PCTR-D TO O-PCTR
	MOVE "SALES" TO O-REPORT
	PRINT COMPANY TITLE LINE
	PRINT COMPANY TITLE LINE2
	PRINT REPORT TITLE LINE
	PRINT BLANK LINE
	PRINT ERROR HEADING LINE

9910-HEADINGS-ERROR
	PCTR-E++
	MOVE PCTR-E TO PCTR
	MOVE "ERROR" TO O-REPORT
	PRINT COMPANY TITLE LINE
	PRINT COMPANY TITLE LINE2
	PRINT REPORT TITLE LINE