IF A = B
	IF C = D
		MOVE 1 TO X
	ELSE
		MOVE 2 TO X
	END-IF
	MOVE 3 TO Y
ELSE
	MOVE 1 TO X
	IF E = F
		NEXT SENTENCE
	ELSE
		MOVE X TO PR-X
	END-IF
END-IF
WRITE PRINTLINE FROM DETAIL-LINE
	AFTER ADVANCING 1 LINE.
IF PR-X = 1
	WRITE PRINTLINE FROM ERR-LINE
		AFTER ADVANCING 1 LINE.
END-IF
	